import streamlit as st
import pickle
from pythainlp.tokenize import word_tokenize

# รายการคำไม่เหมาะสม (ตัวอย่าง)
bad_words = [
    "เหี้ย",
    "สัส",
    "เย็ดแม่",
        "เย้ดแม่",
        "ไอ้",
        "ไอ",
        "ห่ามึง","อีดอก","พ่อมึงอ่ะ","ควาย","ไอ้เอ๋อ","แม่มึงตาย","ปัญญาอ่อน","เหี้ยไร" ,"ควยไร","พ่อมึงอ่ะ","อีสัส","หน้าหี","หน้าเหี้ย","สันดานหมา","ทุเรศ","สถุน","ไม่มีปัญญาหาข้าวแดกหรอ",
    "อีเหี้ย","เฮงซวย","ควย","หน้าผี","อีเปรต","ดอกทอง","แดก" ,"เสือก","บัดซบ","เวร","เชี่ย","มารศาสนา","สะเออะ","สาระแน","ผู้หญิงต่ำๆ","อีร้อยควย"
]

model = pickle.load(open("model.pkl", "rb"))
vectorizer = pickle.load(open("vectorizer.pkl", "rb"))

def preprocess(text):
    return " ".join(word_tokenize(text, engine="newmm"))

st.title("🧠 AI ตรวจจับคำหยาบในแชต")

text = st.text_area("พิมพ์ข้อความที่ต้องการตรวจสอบ")


if st.button("ตรวจสอบ"):
    t = preprocess(text)
    words = t.split()

    # ตรวจคำหยาบจากรายการก่อน
    for w in bad_words:
        if w in words:
            st.error("🔴 พบคำหยาบในประโยค")
            st.stop()

    # ถ้าไม่เจอคำหยาบในลิสต์ → ให้ AI ตรวจ
    x = vectorizer.transform([t])
    result = model.predict(x)[0]

    if result == 1:
        st.error("🔴 พบคำหยาบ")
    else:
        st.success("🟢 ข้อความสุภาพ")


